#include "Interface.h"

void test_print(int someparam) {
	std::cout << "Nothing Special"<<someparam << std::endl;
}

int main(void) {
	Interface class_interface_obj;
	class_interface_obj.AccessPort();
}

//1. Створити два класи з будь - якими приватними даними типу doube / float та паблік - методами доступу до них(read / write).
//2. Створити по одному екземпляру(обʼєкту) кожного класу.
//3. Створити N(згенероване довільне число від 10 до 20) потоків так, що перші N / 2 та другі N / 2 потоків мають різну логіку.
//4. Перші N / 2 потоків, K1 разів(де K1 - довільне згенероване число від 10000 до 20000) кожен генерують довільне число double / float та додають до існуючого числа в обʼєкті 1, а потім генерують довільне число double / float та додають до існуючого числа в обʼєкті 2.
//5. Всі інші потоки, K2 разів(де K2 - довільне згенероване число від 10000 до 20000) кожен генерують довільне число double / float та додають до існуючого числа в обʼєкті 2, а потім генерують довільне число double / float та додають до існуючого числа в обʼєкті 1.
//6. Головний потік чекає заверщення всіх 20 потоків та повідомляє про закінчення та виводить час виконання програми.Не використовувати принцип “холостого ходу”.